## Plan Result (sbox_mgmt - TerraformPlanApply)




<pre><code>Plan: 2 to add, 1 to change, 0 to destroy.</code></pre>

* Create
  * module.data_mgmt_zone.azurerm_eventhub.eventhub[&#34;Eventhub1&#34;]
  * module.data_mgmt_zone.azurerm_eventhub.eventhub[&#34;Eventhub2&#34;]
* Update
  * module.data_mgmt_zone.azurerm_eventhub_namespace.eventhub-namespace




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.data_mgmt_zone.azurerm_eventhub.eventhub["Eventhub1"] will be created
  + resource "azurerm_eventhub" "eventhub" {
      + id                  = (known after apply)
      + message_retention   = 7
      + name                = "Eventhub1"
      + namespace_id        = (known after apply)
      + namespace_name      = "sbox-dlrm-eventhub-ns"
      + partition_count     = 4
      + partition_ids       = (known after apply)
      + resource_group_name = "ingest-mgmt-rg-sbox"
      + status              = "Active"
    }

  # module.data_mgmt_zone.azurerm_eventhub.eventhub["Eventhub2"] will be created
  + resource "azurerm_eventhub" "eventhub" {
      + id                  = (known after apply)
      + message_retention   = 7
      + name                = "Eventhub2"
      + namespace_id        = (known after apply)
      + namespace_name      = "sbox-dlrm-eventhub-ns"
      + partition_count     = 4
      + partition_ids       = (known after apply)
      + resource_group_name = "ingest-mgmt-rg-sbox"
      + status              = "Active"
    }

  # module.data_mgmt_zone.azurerm_eventhub_namespace.eventhub-namespace will be updated in-place
  ~ resource "azurerm_eventhub_namespace" "eventhub-namespace" {
      ~ auto_inflate_enabled                      = true -> false
      ~ capacity                                  = 20 -> 25
        id                                        = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest-mgmt-rg-sbox/providers/Microsoft.EventHub/namespaces/sbox-dlrm-eventhub-ns"
      - maximum_throughput_units                  = 25 -> null
        name                                      = "sbox-dlrm-eventhub-ns"
        tags                                      = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
            "startupMode"  = "always"
        }
        # (14 unchanged attributes hidden)
    }

Plan: 2 to add, 1 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":65,"Program":"tfcmt","SHA1":"","Target":"sbox_mgmt - TerraformPlanApply","Vars":{}} -->